Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 64) 36928       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 256, 256, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 128 73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 128 147584      conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 128, 128 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 256 295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 256 590080      conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 64, 256)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 512)  1180160     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 512)  2359808     conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 512)  2359808     conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 512)  2359808     conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 512)  2359808     conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 512)  2359808     conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 512)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 2, 2, 512)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 4, 4, 512)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 8, 8, 512)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 512, 512, 64) 0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 512, 512, 128 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 512, 512, 512 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1, 128)    65664       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 2, 2, 128)    65664       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 4, 4, 128)    65664       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 128)    65664       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 128 73856       up_sampling2d[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 512, 512, 128 147584      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 512, 512, 128 589952      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 512, 512, 128 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 512, 512, 128 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 512, 512, 128 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 512, 512, 128 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 512, 512, 896 0           conv2d_2[0][0]                   
                                                                 conv2d_5[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 up_sampling2d_3[0][0]            
                                                                 up_sampling2d_4[0][0]            
                                                                 up_sampling2d_5[0][0]            
                                                                 up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 512, 512, 64) 516160      concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 512, 512, 2)  1154        conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 512, 512, 1)  3           conv2d_20[0][0]                  
==================================================================================================
Total params: 15,715,973
Trainable params: 15,715,973
Non-trainable params: 0
